tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask_args appdir: "~/Applications", require_sha: true

brew "asdf"
brew "bat"
brew "fd"
brew "go"
brew "git"
brew "gitui"
brew "lazydocker"
brew "lazygit"
brew "htop"
brew "mas"
brew "starship"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "1password"
cask "alacritty"
cask "alfred"
cask "docker"
cask "firefox"
cask "iterm2"
cask "jetbrains-toolbox"
cask "sizeup"
cask "visual-studio-code"
cask "font-jetbrains-mono-nerd-font"
cask "microsoft-edge"

mas "Amphetamine", id: 937984704
mas "Screen Shade", id: 450429264

{%@@ if context == "home" @@%}
tap "koekeishiya/formulae"

brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

{%@@ elif context == "work" @@%}

{%@@ endif @@%}